In [1]:
import numpy as np
import matplotlib.pyplot as plt
import random
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.feature_selection import VarianceThreshold
from sklearn.preprocessing import MinMaxScaler
import seaborn as sns
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score as acc
from mlxtend.feature_selection import SequentialFeatureSelector as sfs
sns.set()
import math

In [2]:
def Average(input_list):
    return (sum(input_list)+0.0001)/len(input_list)

In [4]:
data=pd.read_csv('inlet.csv')

In [5]:
print(data.index)
print(data.columns)

RangeIndex(start=0, stop=91993, step=1)
Index(['FID', 'recordstart', 'recordend', 'ETP_Inflow_kL_s_1'], dtype='object')

In [6]:
date=pd.to_datetime(data['recordstart'])
data['year']=date.dt.year
data['month']=date.dt.month
data['day']=date.dt.day

In [7]:
data=data.dropna()

In [8]:
data.isna().sum()

FID                  0
recordstart          0
recordend            0
ETP_Inflow_kL_s_1    0
year                 0
month                0
day                  0
dtype: int64

In [9]:
data.head(8)

,FID,recordstart,recordend,ETP_Inflow_kL_s_1,year,month,day
0,51,31-12-2008 12:59:59,31-12-2008 14:00:00,3.922,2008,12,31
1,52,31-12-2008 14:00:00,31-12-2008 15:00:00,3.633,2008,12,31
2,53,31-12-2008 15:00:00,31-12-2008 15:59:59,2.994,2008,12,31
3,54,31-12-2008 15:59:59,31-12-2008 17:00:00,2.464,2008,12,31
4,55,31-12-2008 17:00:00,31-12-2008 18:00:00,2.466,2008,12,31
5,56,31-12-2008 18:00:00,31-12-2008 18:59:59,2.456,2008,12,31
6,57,31-12-2008 18:59:59,31-12-2008 20:00:00,2.445,2008,12,31
7,58,31-12-2008 20:00:00,31-12-2008 21:00:00,2.417,2008,12,31

In [10]:
#creating a new dataframe
new_data=pd.DataFrame(columns=['record_date','avg_inflow'], index=range(50000))
new_data.head(3)

  record_date avg_inflow
0         NaN        NaN
1         NaN        NaN
2         NaN        NaN

In [11]:
# Grouping by date (day) and calculating the mean value of the group, then saving in new dataframe
day=data.iloc[0,6]
month=data.iloc[0,5]
year=data.iloc[0,4]
inflow_list=[]
k=0
for i in range(len(data.index)):
    if day==data.iloc[i,6] and month==data.iloc[i,5] and year==data.iloc[i,4]:
        inflow_list.append(data.iloc[i,3])
        record_date=data.iloc[i,2]
    else:
        if len(inflow_list)==0:
            avg_inflow=np.nan
        else:
            avg_inflow=Average(inflow_list)
            
        new_data.iloc[k,1]=avg_inflow
        new_data.iloc[k,0] =record_date
        k+=1
        day=data.iloc[i,6]
        month=data.iloc [i,5]
        year=data.iloc[i,4]
        inflow_list=[]

In [12]:
new_data.isna().sum()

record_date    46177
avg_inflow     46178
dtype: int64

In [13]:
new_data2=new_data.dropna()

In [14]:
new_data2.isna().sum()

record_date    0
avg_inflow     0
dtype: int64

In [15]:
new_data2

             record_date avg_inflow
0     01-01-2009 0:00:00    2.58892
1     02-01-2009 0:00:00    2.96118
2     03-01-2009 0:00:00    3.22531
3     04-01-2009 0:00:00    3.35409
4     05-01-2009 0:00:00      3.794
...                  ...        ...
3818  26-06-2019 0:00:00    4.79809
3819  27-06-2019 0:00:00    4.77579
3820  28-06-2019 0:00:00    4.84479
3821  29-06-2019 0:00:00    4.95705
3822  30-06-2019 0:00:00    5.93653

[3822 rows x 2 columns]

In [16]:
new_data2.to_csv('new_data_inlet.csv')